Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Для некоторых команд доступны горячие клавиши:
en: Hotkeys are available for some commands:

source: Для непрерывного разбиения
en: For the continuous binning

source: Для непрерывных данных строка внешнего разбиения соответствует одному классу (интервалу) для значений поля основного источника данных.
en: In the case of the continuous data, the external binning string maps one class (bin) for the field values of the main data source.

source: Для них необходимо обеспечить доступ к нужным результатам без необходимости погружения в процесс разработки.
en: They must be provided with access to the required results without necessity of thorough understanding of the development process.

source: Для обращения к опубликованным сервисам из сценария Loginom используются компоненты SOAP-запрос и REST-запрос.
en: To provide access to the published services from the Loginom workflow, the SOAP request and REST request components are used.

source: Для обслуживания хранилища на низком уровне могут использоваться утилиты сторонних разработчиков для СУБД Firebird, MS SQL, Oracle, а также инструменты, поставляемые разработчиками соответствующих баз данных.
en: To provide the data warehouse service, utility software of third party developers can be used at the low level for the Firebird, MS SQL, Oracle DBMS as well as the tools provided by the developers of corresponding databases.

source: Для обучения или переобучения Модели следует:
en: It is required to perform the following actions for the Model training or retraining:

source: Для обучения используется квазиньютоновский метод Бройдена-Флетчера-Гольдфарба-Шанно с ограниченным использованием памяти L-BFGS.
en: The Quasi-Newton Broyden — Fletcher — Goldfarb — Shanno method is used for training with limited use of L-BFGS memory.

source: Для ограничения времени работы предусмотрена возможность ограничить, в том числе одновременно: количество шагов автоподбора и время автоподбора.
en: To limit the operation time, at the same time it is possible to limit also the number of autofit stages and autofit time.

source: Для описания реализации обмена данными можно выделить несколько разделов:
en: To describe the data exchange process, several sections can be identified:

source: Для определения групп, по которым будет производиться обратная агрегация численного поля, требуется опорная таблица, из которой заимствуются сами группы и учитывается процентное распределение значений численного поля между ними.
en: To define the groups by which the inverse aggregation of numeric field will be performed, it is required to use the reference table from which the groups as such will be taken and percentage distribution of the numeric field values between them will be considered.

source: Для открытых Пакетов:
en: For the opened Packages:

source: Для открытых Пакетов допустимо использование всех вариантов, для закрытых используются только Узел-ссылка и Выполнение узла.
en: All options can be used for the public Packages, and Reference node and Node execution are used for the private ones.

source: Для отображения детализированной информации по выделенной ячейке можно использовать следующие визуализаторы:
en: To display the detailed information by the selected cell, it is possible to use the following visualizers:

source: Для отображения порта необходимо в контекстном меню узла выбрать пункт Показать порт управляющих переменных.
en: To display the port, it is required to select the following item in the context menu of the node: Show control variables port.

source: Для отображения портов порядка выполнения необходимо воспользоваться кнопкой панели инструментов области построения сценариев;
en: To display the execution order ports, it is required to use toolbar button of the workflow construction area.

source: Для отображения портов управляющих переменных необходимо в контекстном меню узла выбрать пункт "Показать порт управляющих переменных".
en: To display the control variables ports, it is required to select "Show control variables port" option in the context menu of the node.

source: Для отображения списка должно быть активировано подключение с помощью кнопки Активировать.
en: To display the list, connection must be activated by means of Activate button.

source: Для отображения этих портов необходимо воспользоваться кнопкой панели инструментов области построения Сценариев.
en: To display these ports, it is required to use toolbar button of the Workflow construction area.

source: Для очистки всего списка нажать Удалить все....
en: To clear the whole list, it is required to press Delete all....

source: Для очистки всего списка нажать Удалить все Удалить все....
en: To clear the whole list, it is required to press Delete all Delete all... button.

source: Для очистки всего списка нужно нажать на иконку у одноименного столбца, вызвав выпадающее меню выбрать пункт Удалить все....
en: To clear the whole list, it is required to press icon near the column with the same name by calling the drop-down menu, select Delete all....

source: Для переменных типа Вещественный и Переменный в качестве параметров можно передавать экспоненциальную форму записи числа (пример: 4.205E2, 4.205E-2)
en: The exponential form of number record can be transferred as parameters for the variables related to the Real and Variable types (for example: 4.205E2, 4.205E-2)

source: Для перехода к объектам, находящимся выше по уровню вложенности, следует нажать на соответствующий объект в цепи.
en: To move to the objects located higher as far as the nesting level is concerned, it is required to press corresponding object in the trail.

source: Для перехода между папками можно так же использовать панель Навигация, в которой отображается иерархия папок пользователя.
en: To move between folders, it is also possible to use the Navigation panel in which the user folders hierarchy is displayed.

source: Для перехода на определённую страницу необходимо ввести её номер в поле ввода, расположенное между кнопками навигации.
en: To go to the given page, it is required to enter its number in the entry field located between the navigation buttons.

source: Для подключения к файлам Microsoft Excel 2007 и выше (*.xlsx) в системе необходимо наличие совпадающих по разрядности с сервером Loginom компонентов:
en: To connect to the files of Microsoft Excel 2007 and higher (*.xlsx), the system must include the following components matching the Loginom server by bitness:

source: Для поиска используются регулярные выражения.
en: Regular expressions are used for search.

source: Для поиска отчета созданного от текущего визуализатора необходимо щелкнуть на визуализаторе правой кнопкой мыши и выбрать пункт меню "Показать в отчетах".
en: To search for the report created on the basis of the current visualizer, it is required to click on the required visualizer with the right mouse button and select "Show in reports" menu option.

source: Для показателя Диаграмма размаха при наведении курсора отображается детализация.
en: When hovering cursor over the Box plot indicator, the detailing is displayed.

source: Для полей таблицы необходимо выбрать Назначение из следующих вариантов:
en: It is required to select Usage type for the table fields from the following options:

source: Для полей, участвующих в кластеризации, выставить назначение Используемое.
en: It is required to set Used usage types for the fields that are included into clustering.

source: Для полей, участвующих в обработке, выставить назначения "Транзакция" и "Элемент".
en: It is required to set the "Transaction" and "Item" usage types for the fields that are included into processing.

source: Для получения информации из базы данных используется отдельный обработчик Импорт из базы данных.
en: Separate handler Import from database is used to receive data from the database.

source: Для получения результирующих наборов требуется предварительное обучение обработчика.
en: To get resulting data sets, it is required to provide preliminary training of the handler.

source: Для поля Продажи, шт. настроим параметр Глубина истории равным двум, а параметр Горизонт прогноза — равным единице.
en: For Sales, pieces field, it is required to set Depth period parameter equal to two, and Forecast horizon parameter equal to one.

source: Для пояснения полученного выражения калькулятор поддерживает два типа комментария:
en: To explain the received expression, calculator supports two types of comments:

source: Для представления даты '11.08.1917' в виде «На дворе стоял Август месяц 17 года» используется строка форматирования: «На дворе стоял mmmm месяц yy года».
en: To represent '11.08.1917' date in the following form: "It was August 17" the following formatting string is used: "It was mmmm yy".

source: Для преобразования ответа, полученного в виде JSON, возможно использование конструкции JSON.parse() в компоненте Java-script.
en: To transform the response received in the form of JSON, it is possible to use JSON.parse() construction in Java-script component.

source: Для приема данных с переменной структурой служит автоматическая синхронизация полей/переменных, в ходе которой синхронизируется список выходных полей/переменных порта со списком входных.
en: To receive the data with the variable structure, the automapping of fields/variable is used.The list of output fields/variable of the port is synchronized with the list of the input ones during its course.

source: Для приема и передачи от узла к узлу переменных предусмотрен порт переменных.
en: The variables port is designated for receipt and transfer of variables from node to node.

source: Для применения настроенного форматирования отображения необходимо нажать кнопку Применить.
en: To apply the configured display formatting, it is required to press Apply button.

source: Для примера возьмем две таблицы.
en: Let's consider two tables as an example.

source: Для примера возьмем три таблицы.
en: Let's consider three tables as an example.

source: Для примера используем пример из замены по регулярному выражению:
en: Let's consider the example from replacement by regular expression:

source: Для примера применим три функции агрегации: сумма, количество записей и среднее.
en: As an example, let's use three aggregation functions: sum, number of records and mean.

source: Для проверки подключения к LDAP серверу можно:
en: To check connection to the LDAP server, it is possible to perform the following actions:

source: Для прочих полей оставить "Не задано".
en: "Unspecified" is preserved for other fields.

source: Для прочих полей оставить Не задано.
en: Unspecified is preserved for other fields.

source: Для публикации следует указать путь к файлу пакета, выбрать пространство имен и нажать кнопку Опубликовать.
en: It is required to show the path to the package file, select the namespace and press Publish button for publication.

source: Для работы с REST-сервисом необходимо настроенное подключение к REST-сервису.
en: It is required to provide the configured Connection to REST service to work with REST service.

source: Для работы с SOAP-сервисом необходимо настроенное подключение к SOAP-сервису.
en: It is required to provide the configured Connection to SOAP service to work with SOAP service.

source: Для работы с базой данных, предварительно необходимо создать Подключение соответствующего типа, в зависимости от того к какой базе нужно подключиться.
en: First, it is required to create corresponding Connection to work with the database to be connected with.

source: Для работы с данными из какой-либо базы данных, необходимо выполнить несколько подготовительных действий.
en: It is required to perform several preparatory actions to start the work with data from any database.

source: Для работы с файловым хранилищем в этих редакциях предусмотрен файловый менеджер.
en: File manager is used for the file storage operation in these editions.

source: Для разбиения возможно применение различных алгоритмов (см.
en: Different algorithms can be used for binning (refer to

source: Для разделения столбцов используется символ табуляции.
en: The tabulation character is used to separate the columns.

source: Для редактирования доступны следующие параметры:
en: The following parameters can be edited:

source: Для редактирования списка полей используются следующие кнопки:
en: The following buttons are used to edit the list of fields :

source: Для решения данной задачи пользователь может самостоятельно настраивать необходимый ему вид отчетов.
en: To complete this task, a user can configure the required kind of reports by himself.

source: Для решения задач анализа Loginom позволяет импортировать данные из различных источников и применять к ним необходимые алгоритмы обработки.
en: To solve the analysis tasks, Loginom allows for data import from different sources and application of the required processing algorithms.

source: Для русской локали это строки: "ИСТИНА"("TRUE"), которые преобразуются в логическое TRUE, и "ЛОЖЬ"("FALSE"), которые преобразуются в логическое FALSE.
en: These strings are as follows for the Russian locale: "TRUE" that are transformed to the logical TRUE ones, and "FALSE" that are transforned to the logical FALSE ones.

source: Для свободной зоны:
en: For the free zone:

source: Для связывания необходимо зажать левой кнопкой мыши ячейку поля из левого списка и перенести ее на ячейку поля из правого списка, с которым следует соотнести, затем отпустить левую кнопку мыши, при этом отобразится графическая связь между ними.
en: To establish links, it is required to press the field cell from the left list with the left mouse button and transfer it to the field cell from the right list with which it is required to provide mapping. Then it is required to release the left mouse button, and the graphical link will be displayed in this case.

source: Для связывания портов необходимо навести курсор мыши на порт и зажать левую кнопку мыши, после этого вести курсор к тому порту, с которым надо связать и отпустить левую кнопку мыши.
en: To link the ports, it is required to hover a cursor over the port and press the left mouse button. Then it is required to hover a cursor over the port with which linking is required and release the left mouse button.

source: Для создания Производного компонента необходимо выбрать базовый узел (Подмодель) и в его контекстном меню выбрать пункт Создать производный компонент.
en: To create the Derived Component, it is required to select the base node (Supernode) and Create derived component item in its context menu.

source: Для создания на его основе узла Сценария его необходимо перенести в область построения Сценария.
en: To create on its basis the Workflow node, it must be transferred to the Workflow construction area.

source: Для создания отчета необходимо добавить визуализатор, на основе которого будет построен отчет, выбрать данный визуализатор и нажать кнопку Добавить в отчеты.
en: To create a report, it is required to add the visualizer used to make the report. Then it is required to select this visualizer and press Add to reports button.

source: Для создания последовательности выполнения узлов следует соединить между собой порты задания порядка выполнения (см.
en: To create a sequence of nodes execution, it is required to link the ports used to set the execution order with each other (refer to

source: Для создания соответствия входных и выходных переменных следует перетащить обозначение входной переменной на обозначение выходной.
en: To provide mapping of the input and output variables, it is required to drag the input variable symbol to the output variable symbol.

source: Для создания ссылки следует выполнить следующие операции:
en: It is required to perform the following actions when creating the reference:

source: Для создания ссылки следует:
en: It is required to perform the following actions when creating the reference:

source: Для создания узла:
en: The following actions are required to create the node:

source: Для создания/редактирования подключений необходимо отобразить в панели навигации структуру пакета и выбрать пункт Подключения соответствующего модуля (см.
en: To create/edit connections, it is required to show the package structure on the navigation bar and select Connections of corresponding module (refer to

source: Для сопоставления полей входного и выходного дерева необходимо задать между ними связи.
en: To map the fields of the input and output tree, it is required to establish links between them.

source: Для сортировки элементов текущей директории по определенному параметру следует нажать на одно из полей в верхней части файлового менеджера: Имя, Тип, Размер, Дата изменения, Только чтение и Путь.
en: To sort the current directory items by a particular parameter, it is required to press one of the fields in the upper part of the file manager: Name, Type, Size, Date of change, Read-only and Path.

source: Для списка Выходное дереево на панели инструментов и в контекстном меню доступны команды:
en: The following commands are available for the Output Tree list in the context menu and toolbar:

source: Для ссылки на узлы другого Пакета необходимо в текущем Пакете создать ссылку на другой Пакет.
en: To provide a reference to nodes of the other Package, it is required to create a reference to the other Package in the current Package.

source: Для таких записей поля, соответствующие второй таблице, заполняются значениями NULL;
en: For such records, the NULL values are appended to the fields matching the second table.

source: Для таких записей поля, соответствующие первой таблице, заполняются значениями NULL.
en: For such records, the NULL values are appended to the fields matching the first table.

source: Для таких столбцов в результирующем наборе данных можно задать.
en: For such columns, it is possible to set the following prefixes in the resulting data set:

source: Для такого порта может и не быть связи с другим портом.
en: No link with another port can be established for such port.

source: Для такого узла в Инспекторе свойств будет выведено сообщение: "Узел заблокирован, попробуйте позже".
en: The following message will be displayed in the Property inspector for such node: "Node is locked, try later".

source: Для того чтобы более гибко реализовывать работу Сценария можно использовать переменные — объекты, содержащие только одно значение конкретного типа.
en: To provide more flexible operation of the Workflow, it is possible to use variable. They are objects that contain only one value of the particular type.

source: Для того чтобы выбрать первый рекурсивный узел необходимо выбрать корневой узел и выполнить переход к следующему рекурсивному нераскрытому узлу.
en: To select the first recursive node, it is required to select the root node and move to the next recursive unopened node.

source: Для того чтобы задать ширину поля, необходимо щёлкнуть левой кнопкой мыши рядом с нужным полем и ввести числовое значение с клавиатуры.
en: To set the field width, it is required to click near the required field with the left mouse button and enter the numeric value using the keyboard.

source: Для того чтобы изменить очередность сортировки, над таблицей сортируемых полей расположены кнопки перемещения:
en: To change the sorting order, the navigational buttons are located above the table of sorted fields:

source: Для того чтобы использовать в сценарии какой-либо компонент, его необходимо перенести мышью из панели компонентов в область построения сценария.
en: To use any component in the workflow, it must be dragged from the component panel to the workflow construction area.

source: Для того, чтобы в процессе пакетного выполнения не активировать узел и все его подузлы, необходимо выключить данный режим.
en: It is required to disable this mode not to activate the node and all its subnodes while batch processing.

source: Для того, чтобы в процессе пакетного выполнения не переобучать узел и все его подузлы, необходимо выключить данный режим.
en: It is required to disable this mode not to retrain the node and all its subnodes while batch processing.

source: Для того, чтобы создать иерархическую структуру необходимо в корневой папке добавить хотя бы один дочерний узел.
en: To create the hierarchic structure, it is required to add at least one child node in the root folder.

source: Для того, чтобы создать узел сценария, выполняющий нужную операцию над данными, необходимо мышью перенести соответствующий компонент из панели компонентов в область построения сценария (подробнее см.
en: To create the workflow node that performs the required operation with data, the corresponding component must be dragged from the component panel to the workflow construction area (refer to

source: Для того, чтобы установить время выполнения узла, в значении Бесконечность необходимо в поле тайм-аута ввести либо -1, либо удалить все цифры.
en: To set the node execution time, it is required to enter -1 in the timeout field in the Infinity value, or it is required to delete all digits.

source: Для того, чтобы эти объекты были доступны в других Пакетах, для них должна быть задана область видимости "Открытый (доступен во всех пакетах)".
en: To make these objects available in other Packages, the "Public" (available in all packages) area of visibility must be set for them.

source: Для удаления какой-либо конкретной связи можно воспользоваться командой контекстного меню Удалить связьУдалить связь, вызванную на одном из связанных элементов.
en: To delete any particular link, it is possible to use the context menu command - Delete linkDelete link called in one of the linked items.

source: Для удобства навигации в дереве отдельно представлены узлы текущего модуля и все доступные для ссылки узлы.
en: The current module nodes and all nodes available for reference are separately displayed for navigation convenience.

source: Для узла, принимающего и отдающего набор данных (таблицу), схему движения данных можно представить следующим образом (см.
en: It is possible to represent the schema of the data movement for the node that accepts and gives back the data set (table) as follows:

source: Для упорядоченных и неупорядоченных данных могут применяться различные методы заполнения пропусков.
en: Diffferent imputation methods can be used for ordered and unordered data.

source: Для управления созданными отчетами необходимо перейти в группу Отчеты пакета.
en: To control the created reports, it is required to go to Reports group of the package.

source: Для ускорения процесса автоподбора предусмотрено задание подвыборки, на которой он будет производиться:
en: To speed up the autofit process, it is required to set the subsample in which it will be performed:

source: Для успешного обучения аналитической модели необходимо, чтобы классы были представлены в обучающем множестве примерно в одинаковой пропорции.
en: To provide the successful training of the analytical model, it is required to display classes in the training set approximately in the equal proportion.

source: Для устранения этого различия в публикуемых подмоделях Loginom в имени порта должно указываться <Не задано>.
en: To eliminate this difference in the published Loginom supernodes, it is required to specify <Unspecified> in the port name.

source: Для фильтров в OpenLDAP может потребоваться дополнительная настройка.
en: Additional configuration can be required for filters in OpenLDAP.

source: Для финальной модели.
en: For the final model.

source: Для числовых полей для оценки силы связи используются не численные значения, а соответствующие им ранги.
en: Corresponding ranks, not numerical values, are used for numerical fields to estimate the connection strength.
